---
kind: property
id: P:Autodesk.Revit.DB.StructuralAsset.IsValidObject
source: html/f25b1128-e8af-e38a-e27c-d5dc853773d7.htm
---
# Autodesk.Revit.DB.StructuralAsset.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.